In [5]:
import pandas as pd
iphone_df = pd.read_csv('iphone.csv', index_col=0)

In [6]:
iphone_df.loc['iPhone 8', '메모리']

'2GB'

In [7]:
iphone_df.loc['iPhone X', :]

출시일        2017-11-03
디스플레이             5.8
메모리               3GB
출시 버전        iOS 11.1
Face ID           Yes
Name: iPhone X, dtype: object

In [8]:
iphone_df.loc['iPhone X']

출시일        2017-11-03
디스플레이             5.8
메모리               3GB
출시 버전        iOS 11.1
Face ID           Yes
Name: iPhone X, dtype: object

In [9]:
type(iphone_df.loc['iPhone X'])

pandas.core.series.Series

In [10]:
iphone_df.loc[:, '출시일']

iPhone 7         2016-09-16
iPhone 7 Plus    2016-09-16
iPhone 8         2017-09-22
iPhone 8 Plus    2017-09-22
iPhone X         2017-11-03
iPhone XS        2018-09-21
iPhone XS Max    2018-09-21
Name: 출시일, dtype: object

In [11]:
iphone_df['출시일']

iPhone 7         2016-09-16
iPhone 7 Plus    2016-09-16
iPhone 8         2017-09-22
iPhone 8 Plus    2017-09-22
iPhone X         2017-11-03
iPhone XS        2018-09-21
iPhone XS Max    2018-09-21
Name: 출시일, dtype: object

In [12]:
import pandas as pd

df = pd.read_csv('broadcast.csv', index_col=0)
df.loc[2016, 'KBS']

np.float64(27.583)

In [13]:
df.loc[:, 'JTBC']

2011    7.380
2012    7.878
2013    7.810
2014    7.490
2015    7.267
2016    7.727
2017    9.453
Name: JTBC, dtype: float64

In [17]:
df.loc[:, ['SBS', 'JTBC']]

         SBS   JTBC
2011  11.173  7.380
2012  11.408  7.878
2013   9.673  7.810
2014   9.108  7.490
2015   9.099  7.267
2016   8.669  7.727
2017   8.661  9.453

In [45]:
import pandas as pd

samsong_df = pd.read_csv('data/samsong.csv')
hyundee_df = pd.read_csv('data/hyundee.csv')

samsong = samsong_df['문화생활비']
hyundee = hyundee_df['문화생활비']
day = ['MON', 'TUE', 'WED', 'THU', 'FRI', 'SAT', 'SUN']

final = {"day": day, "samsong": samsong, "hyundee": hyundee}
result = pd.DataFrame(final)
result

   day  samsong  hyundee
0  MON     4308     5339
1  TUE     7644     3524
2  WED     5674     5364
3  THU     8621     9942
4  FRI    23052    33511
5  SAT    15330    19397
6  SUN    19030    19925

In [47]:
import pandas as pd

df = pd.read_csv('data/broadcast.csv', index_col=0)
df.loc[2012:, 'KBS':'SBS']

         KBS     MBC     SBS
2012  36.163  16.022  11.408
2013  31.989  16.778   9.673
2014  31.210  15.663   9.108
2015  27.777  16.573   9.099
2016  27.583  14.982   8.669
2017  26.890  12.465   8.661

In [49]:
iphone_df.loc[[True, False, True, True, False, True, False]]

                      출시일  디스플레이  메모리     출시 버전 Face ID
iPhone 7       2016-09-16    4.7  2GB  iOS 10.0      No
iPhone 8       2017-09-22    4.7  2GB  iOS 11.0      No
iPhone 8 Plus  2017-09-22    5.5  3GB  iOS 11.0      No
iPhone XS      2018-09-21    5.8  4GB  iOS 12.0     Yes

In [53]:
iphone_df.loc[:, [True, False, True, False, False]]

                      출시일  메모리
iPhone 7       2016-09-16  2GB
iPhone 7 Plus  2016-09-16  3GB
iPhone 8       2017-09-22  2GB
iPhone 8 Plus  2017-09-22  3GB
iPhone X       2017-11-03  3GB
iPhone XS      2018-09-21  4GB
iPhone XS Max  2018-09-21  4GB

In [54]:
iphone_df['Face ID'] == 'Yes'

iPhone 7         False
iPhone 7 Plus    False
iPhone 8         False
iPhone 8 Plus    False
iPhone X          True
iPhone XS         True
iPhone XS Max     True
Name: Face ID, dtype: bool

In [58]:
import pandas as pd

df = pd.read_csv('data/broadcast.csv', index_col=0)
condition = df['KBS'] > 30
df.loc[condition, 'KBS']

2011    35.951
2012    36.163
2013    31.989
2014    31.210
Name: KBS, dtype: float64

In [61]:
import pandas as pd

df = pd.read_csv('data/broadcast.csv', index_col=0)
condition = df['SBS'] < df['TV CHOSUN']
df.loc[condition, ['SBS', 'TV CHOSUN']]

        SBS  TV CHOSUN
2014  9.108      9.440
2015  9.099      9.940
2016  8.669      9.829
2017  8.661      8.886

In [6]:
import pandas as pd

df = pd.read_csv('data/body_imperial1.csv', index_col=0)
df.loc[1, 'Weight (Pound)'] = 200
df.drop(21, axis='index', inplace=True)
df.loc[20] = [70, 200]

df

    Height (Inch)  Weight (Pound)
ID
0       73.847017      241.893563
1       70.000000      200.000000
2       74.110105      212.740856
3       71.730978      220.042470
4       69.881796      206.349801
5       67.253016      152.212156
6       68.785081      183.927889
7       68.348516      167.971110
8       67.018950      175.929440
9       63.456494      156.399676
10      71.195382      186.604926
11      62.636675      102.853563
12      62.077832      138.691680
13      60.030434       97.687432
14      59.098250      110.529686
15      66.172652      136.777454
16      67.067155      170.867906
17      63.867992      128.475319
18      69.034243      163.852461
19      61.944246      113.649103
20      70.000000      200.000000

In [19]:
import pandas as pd

df = pd.read_csv('data/body_imperial2.csv', index_col=0)

df['비만도'] = '정상'

df

    Gender  Height (Inch)  Weight (Pound) 비만도
ID
0      NaN      73.847017      241.893563  정상
1      NaN      70.000000      200.000000  정상
2      NaN      74.110105      212.740856  정상
3      NaN      71.730978      220.042470  정상
4      NaN      69.881796      206.349801  정상
5      NaN      67.253016      152.212156  정상
6      NaN      68.785081      183.927889  정상
7      NaN      68.348516      167.971110  정상
8      NaN      67.018950      175.929440  정상
9      NaN      63.456494      156.399676  정상
10     NaN      71.195382      186.604926  정상
11     NaN      62.636675      102.853563  정상
12     NaN      62.077832      138.691680  정상
13     NaN      60.030434       97.687432  정상
14     NaN      59.098250      110.529686  정상
15     NaN      66.172652      136.777454  정상
16     NaN      67.067155      170.867906  정상
17     NaN      63.867992      128.475319  정상
18     NaN      69.034243      163.852461  정상
19     NaN      61.944246      113.649103  정상
20     NaN      70.000000      200.000000  정상

In [23]:
df.loc[0:10, 'Gender'] = 'Male'
df.loc[11:20, 'Gender'] = 'Female'
df

    Gender  Height (Inch)  Weight (Pound) 비만도
ID
0     Male      73.847017      241.893563  정상
1     Male      70.000000      200.000000  정상
2     Male      74.110105      212.740856  정상
3     Male      71.730978      220.042470  정상
4     Male      69.881796      206.349801  정상
5     Male      67.253016      152.212156  정상
6     Male      68.785081      183.927889  정상
7     Male      68.348516      167.971110  정상
8     Male      67.018950      175.929440  정상
9     Male      63.456494      156.399676  정상
10    Male      71.195382      186.604926  정상
11  Female      62.636675      102.853563  정상
12  Female      62.077832      138.691680  정상
13  Female      60.030434       97.687432  정상
14  Female      59.098250      110.529686  정상
15  Female      66.172652      136.777454  정상
16  Female      67.067155      170.867906  정상
17  Female      63.867992      128.475319  정상
18  Female      69.034243      163.852461  정상
19  Female      61.944246      113.649103  정상
20  Female      70.000000      200.000000  정상

In [45]:
import pandas as pd
    
df = pd.read_csv('data/toeic.csv')
df['합격 여부'] = ( df['LC'] + df['RC'] >= 600 ) & ( df['LC'] >= 250 ) & ( df['RC'] >= 250 )
df

   Gender   LC   RC  합격 여부
0  female  315  320   True
1  female  430  245  False
2  female  430  475   True
3    male  180  220  False
4    male  325  350   True
5  female  295  400   True
6  female  405  475   True
7    male  155  150  False
8    male  280  315  False
9  female  215  475  False

In [116]:
import pandas as pd

df = pd.read_csv('data/Puzzle_before.csv')

df['A'] = df['A'] * 2
df.loc[:, 'B':'E'] = (df.loc[:, 'B':'E'] >= 80) * 1
df.loc[2, 'F'] = 99
df

    A  B  C  D  E   F
0   2  0  0  1  0  13
1   4  0  0  1  0  24
2   6  1  0  1  0  99
3   8  1  1  0  1  78
4  10  0  1  0  1  61

In [117]:
laptops_df = pd.read_csv('data/laptops.csv')
laptops_df

,brand,model,ram,hd_type,hd_size,screen_size,price,processor_brand,processor_model,clock_speed,graphic_card_brand,graphic_card_size,os,weight,comments
0,Dell,Inspiron 15-3567,4,hdd,1024,15.6,40000,intel,i5,2.5,intel,NaN,linux,2.50,NaN
1,Apple,MacBook Air,8,ssd,128,13.3,55499,intel,i5,1.8,intel,2.0,mac,1.35,NaN
2,Apple,MacBook Air,8,ssd,256,13.3,71500,intel,i5,1.8,intel,2.0,mac,1.35,NaN
3,Apple,MacBook Pro,8,ssd,128,13.3,96890,intel,i5,2.3,intel,2.0,mac,3.02,NaN
4,Apple,MacBook Pro,8,ssd,256,13.3,112666,intel,i5,2.3,intel,2.0,mac,3.02,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
162,Asus,A555LF,8,hdd,1024,15.6,39961,intel,i3 4th gen,1.7,nvidia,2.0,windows,2.30,NaN
163,Asus,X555LA-XX172D,4,hdd,500,15.6,28489,intel,i3 4th gen,1.9,intel,NaN,linux,2.30,NaN
164,Asus,X554LD,2,hdd,500,15.6,29199,intel,i3 4th gen,1.9,intel,1.0,linux,2.30,NaN
165,Asus,X550LAV-XX771D,2,hdd,500,15.6,29990,intel,i3 4th gen,1.7,intel,NaN,linux,2.50,NaN
166,Asus,X540LA-XX538T,4,hdd,1024,15.6,30899,intel,i3 5th gen,2.0,intel,NaN,windows,2.30,NaN

In [120]:
laptops_df.head

<bound method NDFrame.head of      brand             model  ram hd_type  hd_size  screen_size   price  \
0     Dell  Inspiron 15-3567    4     hdd     1024         15.6   40000
1    Apple       MacBook Air    8     ssd      128         13.3   55499
2    Apple       MacBook Air    8     ssd      256         13.3   71500
3    Apple       MacBook Pro    8     ssd      128         13.3   96890
4    Apple       MacBook Pro    8     ssd      256         13.3  112666
..     ...               ...  ...     ...      ...          ...     ...
162   Asus            A555LF    8     hdd     1024         15.6   39961
163   Asus     X555LA-XX172D    4     hdd      500         15.6   28489
164   Asus            X554LD    2     hdd      500         15.6   29199
165   Asus    X550LAV-XX771D    2     hdd      500         15.6   29990
166   Asus     X540LA-XX538T    4     hdd     1024         15.6   30899

    processor_brand processor_model  clock_speed graphic_card_brand  \
0             intel              i5          2.5              intel
1             intel              i5          1.8              intel
2             intel              i5          1.8              intel
3             intel              i5          2.3              intel
4             intel              i5          2.3              intel
..              ...             ...          ...                ...
162           intel      i3 4th gen          1.7             nvidia
163           intel      i3 4th gen          1.9              intel
164           intel      i3 4th gen          1.9              intel
165           intel      i3 4th gen          1.7              intel
166           intel      i3 5th gen          2.0              intel

     graphic_card_size       os  weight comments
0                  NaN    linux    2.50      NaN
1                  2.0      mac    1.35      NaN
2                  2.0      mac    1.35      NaN
3                  2.0      mac    3.02      NaN
4                  2.0      mac    3.02      NaN
..                 ...      ...     ...      ...
162                2.0  windows    2.30      NaN
163                NaN    linux    2.30      NaN
164                1.0    linux    2.30      NaN
165                NaN    linux    2.50      NaN
166                NaN  windows    2.30      NaN

[167 rows x 15 columns]>

In [121]:
laptops_df.shape

(167, 15)

In [122]:
laptops_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 167 entries, 0 to 166
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   brand               167 non-null    object
 1   model               167 non-null    object
 2   ram                 167 non-null    int64
 3   hd_type             167 non-null    object
 4   hd_size             167 non-null    int64
 5   screen_size         167 non-null    float64
 6   price               167 non-null    int64
 7   processor_brand     167 non-null    object
 8   processor_model     167 non-null    object
 9   clock_speed         166 non-null    float64
 10  graphic_card_brand  163 non-null    object
 11  graphic_card_size   81 non-null     float64
 12  os                  167 non-null    object
 13  weight              160 non-null    float64
 14  comments            55 non-null     object
dtypes: float64(4), int64(3), object(8)
memory usage: 19.7+ KB

In [123]:
laptops_df.sort_values(by='price', ascending=False)

,brand,model,ram,hd_type,hd_size,screen_size,price,processor_brand,processor_model,clock_speed,graphic_card_brand,graphic_card_size,os,weight,comments
5,Apple,MacBook Pro (TouchBar),16,ssd,512,15.0,226000,intel,i7,2.70,intel,2.0,mac,2.5,NaN
90,Alienware,15 Notebook,16,hdd,1024,15.6,199000,intel,i7,2.60,nvidia,8.0,windows,3.5,Maximum Display Resolution : 1920 x 1080 pixel
96,Alienware,AW13R3-7000SLV-PUS,8,ssd,256,13.3,190256,intel,i7,3.00,nvidia,6.0,windows,2.6,13.3 inch FHD (1920 x 1080) IPS Anti-Glare 300...
31,Acer,Predator 17,16,ssd,256,17.3,178912,intel,i7,2.60,nvidia,NaN,windows,4.2,Integrated Graphics
154,Microsoft,Surface Book CR9-00013,8,ssd,128,13.5,178799,intel,i5,1.80,intel,NaN,windows,1.5,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
73,Acer,Aspire ES1-523,4,hdd,1024,15.6,19465,amd,A4-7210,1.80,amd,NaN,linux,2.4,NaN
100,Acer,A315-31-P4CRUN.GNTSI.002,4,hdd,500,15.6,18990,intel,pentium,1.10,intel,NaN,windows,NaN,NaN
108,Acer,Aspire ES-15 NX.GKYSI.010,4,hdd,500,15.6,17990,amd,A4-7210,1.80,amd,NaN,windows,2.4,NaN
83,Acer,A315-31CDC UN.GNTSI.001,2,ssd,500,15.6,17990,intel,Celeron,1.10,intel,NaN,windows,2.1,NaN
148,Acer,Aspire SW3-016,2,ssd,32,10.1,13872,intel,Atom Z8300,1.44,intel,NaN,windows,1.2,NaN

In [124]:
laptops_df['brand'].unique()

array(['Dell', 'Apple', 'Acer', 'HP', 'Lenovo', 'Alienware', 'Microsoft',
       'Asus'], dtype=object)

In [125]:
laptops_df['brand'].value_counts()

brand
HP           55
Acer         35
Dell         31
Lenovo       18
Asus          9
Apple         7
Alienware     6
Microsoft     6
Name: count, dtype: int64

In [126]:
laptops_df['brand'].describe()

count     167
unique      8
top        HP
freq       55
Name: brand, dtype: object

In [128]:
world_df = pd.read_csv('data/world_cities.csv', index_col=0)
world_df

    City / Urban area     Country  Population  Land area (in sqKm)
0        Buenos Aires   Argentina    11200000                 2266
1           Melbourne   Australia     3162000                 2080
2              Sydney   Australia     3502000                 1687
3            Brisbane   Australia     1508000                 1603
4               Perth   Australia     1177000                  964
..                ...         ...         ...                  ...
245            Canton         USA      267000                  372
246           Spokane         USA      335000                  371
247          Tashkent  Uzbekistan     2200000                  531
248  Ho Chi Minh City     Vietnam     4900000                  518
249            Harare    Zimbabwe     1750000                  712

[249 rows x 4 columns]

In [137]:
world_df['City / Urban area'].value_counts()

City / Urban area
Buenos Aires            1
Bridgeport//Stamford    1
San Diego               1
Baltimore               1
Cincinnati              1
                       ..
Osaka/Kobe/Kyoto        1
Fukuoka                 1
Sapporo                 1
Kuwait                  1
Harare                  1
Name: count, Length: 249, dtype: int64

In [135]:
world_df['Country'].value_counts()

Country
USA            105
France          15
Brazil          10
Canada           9
Germany          8
              ...
Israel           1
Kuwait           1
Malaysia         1
Netherlands      1
Zimbabwe         1
Name: count, Length: 61, dtype: int64

In [138]:
world_df

    City / Urban area     Country  Population  Land area (in sqKm)
0        Buenos Aires   Argentina    11200000                 2266
1           Melbourne   Australia     3162000                 2080
2              Sydney   Australia     3502000                 1687
3            Brisbane   Australia     1508000                 1603
4               Perth   Australia     1177000                  964
..                ...         ...         ...                  ...
245            Canton         USA      267000                  372
246           Spokane         USA      335000                  371
247          Tashkent  Uzbekistan     2200000                  531
248  Ho Chi Minh City     Vietnam     4900000                  518
249            Harare    Zimbabwe     1750000                  712

[249 rows x 4 columns]

In [141]:
pop_dens = world_df['Population'] / world_df['Land area (in sqKm)']
result = (pop_dens > 10000).sum()
result

np.int64(19)

In [146]:
world_df['Density'] = world_df['Population'] / world_df['Land area (in sqKm)']
world_df

,City / Urban area,Country,Population,Land area (in sqKm),Density
0,Buenos Aires,Argentina,11200000,2266,4942.630185
1,Melbourne,Australia,3162000,2080,1520.192308
2,Sydney,Australia,3502000,1687,2075.874333
3,Brisbane,Australia,1508000,1603,940.736120
4,Perth,Australia,1177000,964,1220.954357
...,...,...,...,...,...
245,Canton,USA,267000,372,717.741935
246,Spokane,USA,335000,371,902.964960
247,Tashkent,Uzbekistan,2200000,531,4143.126177
248,Ho Chi Minh City,Vietnam,4900000,518,9459.459459
249,Harare,Zimbabwe,1750000,712,2457.865169

In [147]:
df_high_density = world_df[world_df['Density'] > 10000]

In [148]:
df_high_density.info()

<class 'pandas.core.frame.DataFrame'>
Index: 19 entries, 32 to 129
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   City / Urban area    19 non-null     object
 1   Country              19 non-null     object
 2   Population           19 non-null     int64
 3   Land area (in sqKm)  19 non-null     int64
 4   Density              19 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 912.0+ bytes

In [166]:
df_high_density_city = df_high_density.sort_values(by='Density', ascending=False)

In [168]:
df_high_density_city['City / Urban area']

75            Mumbai
74           Kolkata
101          Karachi
99             Lagos
34          Shenzhen
123    Seoul/Incheon
129           Taipei
76           Chennai
38            Bogota
33          Shanghai
102             Lima
32           Beijing
71             Delhi
39          Kinshasa
78            Tehran
103           Manila
36           Tianjin
77           Jakarta
73         Bangalore
Name: City / Urban area, dtype: object

In [214]:
# 그 나라에 속한 도시가 4개 들어 있는 나라의 이름을 출력하세요.
country_counts = world_df['Country'].value_counts()
countries = country_counts[country_counts == 4].index
countries

Index(['Italy'], dtype='object', name='Country')

In [244]:
enrol_df = pd.read_csv('data/enrolment_1.csv')
enrol_df

           id  year             course name
0     2777729     1  information technology
1     2777730     2                 science
2     2777765     1                    arts
3     2777766     2                    arts
4     2777785     1                     mba
...       ...   ...                     ...
1995  2796805     3    computer application
1996  2796812     1                 nursing
1997  2796813     2                 nursing
1998  2796814     3                 nursing
1999  2796815     4                 nursing

[2000 rows x 3 columns]

In [248]:
import pandas as pd

df = pd.read_csv('data/enrolment_1.csv')
df["status"] = "allowed"

# 조건 1
boolean1 = df["course name"] == "information technology"
boolean2 = df["year"] == 1
df.loc[boolean1 & boolean2, "status"] = "not allowed"

# 조건 2
boolean3= df["course name"] == "commerce"
boolean4= df["year"] == 4
df.loc[boolean3& boolean4, "status"] = "not allowed"

# 조건 3
allowed = df["status"] == "allowed"
course_counts = df.loc[allowed, "course name"].value_counts()
closed_courses = list(course_counts[course_counts < 5].index)
for course in closed_courses:
    df.loc[df["course name"] == course, "status"] = "not allowed"
df

           id  year             course name       status
0     2777729     1  information technology  not allowed
1     2777730     2                 science      allowed
2     2777765     1                    arts      allowed
3     2777766     2                    arts      allowed
4     2777785     1                     mba      allowed
...       ...   ...                     ...          ...
1995  2796805     3    computer application      allowed
1996  2796812     1                 nursing      allowed
1997  2796813     2                 nursing      allowed
1998  2796814     3                 nursing      allowed
1999  2796815     4                 nursing      allowed

[2000 rows x 4 columns]

In [274]:
enrol_df = pd.read_csv('data/enrolment_2.csv')
allowed = enrol_df['status'] == 'allowed'
course_counts = enrol_df.loc[allowed, 'course name'].value_counts()

In [275]:
auditorium = list(course_counts[course_counts >= 80].index)
large_room = list(course_counts[(80 > course_counts) & (course_counts >= 40)].index)
medium_room = list(course_counts[(40 > course_counts) & (course_counts >= 15)].index)
small_room = list(course_counts[(15 > course_counts) & (course_counts >= 5)].index)

In [277]:
not_allowed = enrol_df['status'] == 'not allowed'
df.loc[not_allowed, 'room assignment'] = 'not assigned'

In [278]:
for course in auditorium:
    df.loc[(df['course name'] == course) & allowed, 'room assignment'] = 'Auditorium'
for course in large_room:
    df.loc[(df['course name'] == course) & allowed, 'room assignment'] = 'Large room'
for course in medium_room:
    df.loc[(df['course name'] == course) & allowed, 'room assignment'] = 'Medium room'
for course in small_room:
    df.loc[(df['course name'] == course) & allowed, 'room assignment'] = 'Small room'

df

           id  year             course name       status room assignment
0     2777729     1  information technology  not allowed    not assigned
1     2777730     2                 science      allowed      Auditorium
2     2777765     1                    arts      allowed      Auditorium
3     2777766     2                    arts      allowed      Auditorium
4     2777785     1                     mba      allowed      Small room
...       ...   ...                     ...          ...             ...
1995  2796805     3    computer application      allowed     Medium room
1996  2796812     1                 nursing      allowed     Medium room
1997  2796813     2                 nursing      allowed     Medium room
1998  2796814     3                 nursing      allowed     Medium room
1999  2796815     4                 nursing      allowed     Medium room

[2000 rows x 5 columns]

In [288]:
df.columns

Index(['id', 'year', 'course name', 'status', 'room assignment'], dtype='object')

In [ ]:
import pandas as pd

df = pd.read_csv('data/enrolment_3.csv')

# 과목별 인원 가져오기
allowed = df["status"] == "allowed"
course_counts = df.loc[allowed, "course name"].value_counts()

# 각 강의실 규모에 해당되는 과목 리스트 만들기
auditorium_list = list(course_counts[course_counts >= 80].index)
large_room_list = list(course_counts[(80 > course_counts) & (course_counts >= 40)].index)
medium_room_list = list(course_counts[(40 > course_counts) & (course_counts >= 15)].index)
small_room_list = list(course_counts[(15 > course_counts) & (course_counts > 4)].index)

# 강의실 이름 붙이기
for i in range(len(auditorium_list)):
    df.loc[(df["course name"] == sorted(auditorium_list)[i]) & allowed, "room assignment"] = "Auditorium-" + str(i + 1)

for i in range(len(large_room_list)):
    df.loc[(df["course name"] == sorted(large_room_list)[i]) & allowed, "room assignment"] = "Large-" + str(i + 1)
    
for i in range(len(medium_room_list)):
    df.loc[(df["course name"] == sorted(medium_room_list)[i]) & allowed, "room assignment"] = "Medium-" + str(i + 1)
    
for i in range(len(small_room_list)):
    df.loc[(df["course name"] == sorted(small_room_list)[i]) & allowed, "room assignment"] = "Small-" + str(i + 1)

# column 이름 바꾸기
df.rename(columns={"room assignment": "room number"}, inplace = True)
    
# 테스트 코드
df